// Числа від 1 до N записано по колу.
// Задається послідовність кроків KK.
// Коло обходять і послідовно видаляють кожен KK[i]-ий елемент.
// Коли послідовність кроків доходить кінця, вона запускається заново з початку.
// (Наприклад, якщо KK=[2,3,5], то починаючи з початку кола видаляють
// один елемент через 2, потім один елемент через 3, потім один елемент через 5,
// і потім знову один елемент через 2 і так далі).
// Вивести список елементів в порядку видалення.
// Вивести, яким по порядку буде видалено задане число.
// Вивести, яке число буде видалено на заданому кроці, починаючи з останнього
// (тобто якщо задано крок 0 – яке число видалиться останнім,
// якщо задано 1 – яке видалиться передостаннім і т.д.)

int main(){}
